git init - Она отвечает за инициализацию нашего проекта. При вызове этой команды создается скрытая папка .git и в ней хранится все необходимые файлы нашего репозитория
git remode add name_url - она добавляет удаленный репозиторий который находится на каком-то сервере
git pull origin master - при вызове этой команды мы стягиваем изменения с кокой либо ветки. Сейчас мы стягиваем с ветки origin master
git status - данная команда показывает статус файлов проекта
git add . - добавляем в индекс файлы
git commit -m "comment" - она добавляет все файлы в индексе во внутренную базу данных и сохраняет их состояние на данный момент
git branch - менеджер веток
git branch name_branch - можно сохдать новую ветку
git chechout name_branch - данная команда делает переключение на ветку с именем name_branch
git push name_branch - это команда отвечает за отправку кода в удалённый репозитори
git push origin master - буду отправлять когда буду работать со своим проектом
git reset filename - данная команда отвечает за удаление файла с каким-то именем из индекса
